In [3]:
import mysql.connector as sql
import pandas as pd

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro",
    buffered = True             # Unread result found issue
)                                              # if using pandas no need to use buffer

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f85f47128f0>

# upper()

In [4]:
# 
"""sales table
	product_id	sell_price	qty	  state
0	121	                320.0	        3	california
1	121	                320.0	        6	taxas
2	121	                320.0	        4	alaska
3	123	                290.0	        2	taxas
4	123             	290.0	        7	california
5	123	                290.0	        4	washington
6	121	                320.0	        7	ohio
7	121	                320.0	        2	Arizona
8	123	                290.0	        8	colorado
"""


sql_query = """
SELECT product_id , sell_price, qty, upper(state)
FROM sales;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   product_id  sell_price  qty upper(state)
0         121       320.0    3   CALIFORNIA
1         121       320.0    6        TAXAS
2         121       320.0    4       ALASKA
3         123       290.0    2        TAXAS
4         123       290.0    7   CALIFORNIA
5         123       290.0    4   WASHINGTON
6         121       320.0    7         OHIO
7         121       320.0    2      ARIZONA
8         123       290.0    8     COLORADO

# lower()

In [5]:
sql_query = """
SELECT lower("TAIWAN");
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  lower("TAIWAN")
0          taiwan